{
    "ChurnBaseValue": "Numerical value indicating the base likelihood of churn for a customer. This could represent a model's base prediction before considering the effect of other variables.",
    "SeniorCitizen": "Binary numerical variable indicating whether the customer is a senior citizen (1) or not (0).",
    "tenure": "Numerical variable representing the number of months the customer has been with the company.",
    "MonthlyCharges": "Numerical variable indicating how much the customer is charged on a monthly basis.",
    "TotalCharges": "Numerical variable representing the total amount charged to the customer over the tenure.",
    "gender_Male": "Binary numerical variable indicating the customer's gender as male (1) or not (0).",
    "Partner_Yes": "Binary numerical variable indicating whether the customer has a partner (1) or not (0).",
    "Dependents_Yes": "Binary numerical variable indicating whether the customer has dependents (1) or not (0).",
    "PhoneService_Yes": "Binary numerical variable indicating whether the customer subscribes to phone service (1) or not (0).",
    "MultipleLines_No phone service": "Binary numerical variable indicating whether the customer does not have phone service and therefore cannot have multiple lines (1) or not applicable (0).",
    "MultipleLines_Yes": "Binary numerical variable indicating whether the customer has multiple phone lines (1) or not (0).",
    "InternetService_Fiber optic": "Binary numerical variable indicating whether the customer uses a fiber optic internet service (1) or not (0).",
    "InternetService_No": "Binary numerical variable indicating whether the customer does not have internet service (1) or not (0).",
    "OnlineSecurity_No internet service": "Binary numerical variable indicating the customer has no internet service, thus no online security service (1) or not applicable (0).",
    "OnlineSecurity_Yes": "Binary numerical variable indicating whether the customer subscribes to an online security service (1) or not (0).",
    "OnlineBackup_No internet service": "Similar to the online security variable, this indicates no internet service (1) or not applicable (0) for online backup services.",
    "OnlineBackup_Yes": "Indicates whether the customer has online backup services (1) or not (0).",
    "DeviceProtection_No internet service": "Indicates no internet service (1) or not applicable (0) for device protection services.",
    "DeviceProtection_Yes": "Indicates whether the customer has device protection services (1) or not (0).",
    "TechSupport_No internet service": "Indicates no internet service (1) or not applicable (0) for tech support services.",
    "TechSupport_Yes": "Indicates whether the customer subscribes to tech support services (1) or not (0).",
    "StreamingTV_No internet service": "Indicates no internet service (1) or not applicable (0) for streaming TV services.",
    "StreamingTV_Yes": "Indicates whether the customer subscribes to streaming TV services (1) or not (0).",
    "StreamingMovies_No internet service": "Indicates no internet service (1) or not applicable (0) for streaming movies services.",
    "StreamingMovies_Yes": "Indicates whether the customer subscribes to streaming movies services (1) or not (0).",
    "Contract_One year": "Binary numerical variable indicating whether the customer is in a one-year contract (1) or not (0).",
    "Contract_Two year": "Indicates whether the customer is in a two-year contract (1) or not (0).",
    "PaperlessBilling_Yes": "Indicates whether the customer has opted for paperless billing (1) or not (0).",
    "PaymentMethod_Credit card (automatic)": "Indicates whether the customer's payment method is an automatic credit card payment (1) or not (0).",
    "PaymentMethod_Electronic check": "Indicates whether the customer's payment method is an electronic check (1) or not (0).",
    "PaymentMethod_Mailed check": "Indicates whether the customer's payment method is a mailed check (1) or not (0)."
}